export const questions = [
    {
        question: "Агонисты опиатных рецепторов:",
        type: "multiple",
        variants: [
            "Ацетилсалициловая кислота",
            "Метамизол",
            "Фентанил",
            "Метадон",
            "Тригексифенидил",
        ]
    },
    {
        question: "Агонисты опиатных рецепторов:",
        type: "multiple",
        variants: [
            "Ацетилсалициловая кислота",
            "Метамизол",
            "Фентанил",
            "Тригексифенидил",
            "Метадон",
        ]
    },
    {
        question: "Для Галотана характерно:",
        type: "multiple",
        variants: [
            "Низкая наркотическая активность",
            "Продолжительная стадия возбуждения",
            "Вызывает выраженное расслабление скелетных мышц",
            "Медленное пробуждение при прекращении ингаляции",
            "Отсутствие пожароопасности",
        ]
    },
    {
        question: "Со стороны сердечно-сосудистой системы Галотан вызывает:",
        type: "multiple",
        variants: [
            "Тахикардию",
            "Брадикардию",
            "Сердечные аритмии",
            "Повышение артериального давления",
            "Гипотензию",
        ]
    },
    {
        question: "Показания к применению морфина:",
        type: "multiple",
        variants: [
            "Лечение синдрома алкогольной абстиненции",
            "Для расширения зрачка",
            "Лечение запора",
            "Лечение отёка лёгких",
            "Купирование болевого синдрома при инфаркте миокарда",
        ]
    },
    {
        question: "Причины обстипации, возникающей при введении морфина:",
        type: "multiple",
        variants: [
            "Блокада рецепторов мотилина",
            "Угнетение секреции пищеварительных желез",
            "Спазм сфинктеров ЖКТ",
            "Угнетение перистальтических движений кишечника",
            "Снижение тонуса гладких мышц кишечной стенки",
        ]
    },
    {
        question: "Эффекты стимуляции µ-рецепторов:",
        type: "multiple",
        variants: [
            "Активация кашлевого центра",
            "Расслабление сфинктеров ЖКТ (Одди и.др.)",
            "Облегчение мочеиспускания",
            "Эметическое действие",
            "Миоз",
        ]
    },
    {
        question: "Медиаторы антиноцицептивной системы:",
        type: "multiple",
        variants: [
            "Опиодидные пептиды",
            "Простагландины Е",
            "Кинины",
            "ГАМК",
            "Гистамин",
        ]
    },
    {
        question: "Медиаторы боли:",
        type: "multiple",
        variants: [
            "Гистамин",
            "ГАМК",
            "Субстанция Р",
            "Катехоламины",
            "Опиоидные пептиды",
        ]
    },
    {
        question: "Медиаторы антиноцицептивной системы:",
        type: "multiple",
        variants: [
            "Серотонин",
            "Ацетилхолин",
            "Аденозин",
            "Каннабиноиды",
            "АТФ",
        ]
    },
    {
        question: "Медиаторы боли:",
        type: "multiple",
        variants: [
            "Энкефалины",
            "Опиоидные пептиды",
            "Простагландин Е",
            "Серотонин",
            "АТФ",
        ]
    },
    {
        question: "В отношении морфина верно:",
        type: "multiple",
        variants: [
            "Расширяет зрачок",
            "Купирует боль любого происхождения",
            "Вызывает эйфорию",
            "Вызывает диарею",
            "Уменьшает объем легочной вентиляции",
        ]
    },
    {
        question: "Для тиопентал-натрия характерно:",
        type: "multiple",
        variants: [
            "Наркоз вызывает быстро",
            "Стадия возбуждения практически отсутствует",
            "Стадия возбуждения выражена",
            "Продолжительность наркоза 20-30 мин",
            "Стимуляция сосудодвигательного и дыхательного центров",
        ]
    },
    {
        question: "Свойства ацетилсалициловой кислоты:",
        type: "multiple",
        variants: [
            "Болеутоляющее действие",
            "Противовоспалительное действие",
            "Жаропонижающее действие",
            "Антиагрегантное действие",
            "Подавление кашля",
        ]
    },
    {
        question: "Свойства парацетамола:",
        type: "multiple",
        variants: [
            "Болеутоляющее действие",
            "Противовоспалительное действие",
            "Жаропонижающее действие",
            "Антиагрегантное действие",
            "Подавление перистальтики ЖКТ",
        ]
    },
    {
        question: "Азота закись применяют:",
        type: "multiple",
        variants: [
            "Для наркоза при хирургических операциях (в сочетании с другими средствами для наркоза)",
            "При инфаркте миокарда для купирования болей",
            "Для обезболивания в послеоперационном периоде",
            "Для расслабления скелетных мышц при судорогах",
            "При отёке лёгких для купирования апноэ",
        ]
    },
    {
        question: "Побочные эффекты кетамина:",
        type: "multiple",
        variants: [
            "Гипотензия",
            "Повышение артериального давления",
            "Тахикардия",
            "Галлюцинации после наркоза",
            "Брадикардия",
        ]
    },
    {
        question: "При снижении артериального давления на фоне галотанового наркоза не следует вводить:",
        type: "multiple",
        variants: [
            "Фенилэфрин",
            "Эпинефрин",
            "Норэпинефрин",
            "Эфедрин",
            "Атропин",
        ]
    },

    {
        question: "Побочные эффекты,характерные для производных пиразолона:",
        type: "multiple",
        variants: [
            "Нарушение слуха",
            "Лейкопения",
            "Изъявления желудочно-кишечного тракта",
            "Отеки",
            "Угнетение дыхания",
        ]
    },
    {
        question: "При длительном применении опиатов толерантность развивается ко всем нижеперечисленным эффектам, кроме:",
        type: "multiple",
        variants: [
            "Эйфория",
            "Анальгезия",
            "Миоз",
            "Угнетение дыхания",
            "Брадикардия",
        ]
    },
    {
        question: "Больным с сильной кровопотерей противопоказаны:",
        type: "multiple",
        variants: [
            "Галотан",
            "Изофлуран",
            "Кетамин",
            "Пропофол",
            "Тиопентал натрия",
        ]
    },
    {
        question: "Отметьте анксиолитик (один ответ):",
        type: "single",
        variants: [
            "Хлорпромазин",
            "Галоперидол",
            "Дроперидол",
            "Дифенгидрамин",
            "Диазепам",
        ]
    },
    {
        question: "Мелатонин используют при (один ответ):",
        type: "single",
        variants: [
            "Уменьшенной потребности во сне",
            "Смене часовых поясов для коррекции биоритмов",
            "Сонливости",
            "Ишемическом поражении мозга",
            "Психическом возбуждении",
        ]
    },
    {
        question: "Седативно-гипногеным действием обладают все перечисленные средства, кроме (один ответ):",
        type: "single",
        variants: [
            "Буспирона",
            "Флумазенила",
            "Амобарбитала",
            "Триазолама",
            "Зопиклона",
        ]
    },
    {
        question: "Анксиолитический эффект полезен при (один ответ):",
        type: "single",
        variants: [
            "Способность вызывать сон",
            "Повышение настроения",
            "Стимуляция ЦНС",
            "Устранение депрессии",
            "Устранение тревоги",
        ]
    },
    {
        question: "Мелатонин используют при (один ответ):",
        type: "single",
        variants: [
            "Уменьшенной потребности во сне",
            "Смене часовых поясов для коррекции биоритмов",
            "Сонливости",
            "Ишемическом поражении мозга",
            "Психическом возбуждении",
        ]
    },
    {
        question: "Агонисты опиатных рецепторов:",
        type: "multiple",
        variants: [
            "Ацетилсалициловая кислота",
            "Метамизол",
            "Фентанил",
            "Метадон",
            "Тригексифенидил",
        ]
    },
    {
        question: "Агонисты опиатных рецепторов:",
        type: "multiple",
        variants: [
            "Ацетилсалициловая кислота",
            "Метамизол",
            "Фентанил",
            "Метадон",
            "Тригексифенидил",
        ]
    },
    {
        question: "Агонисты опиатных рецепторов:",
        type: "multiple",
        variants: [
            "Ацетилсалициловая кислота",
            "Метамизол",
            "Фентанил",
            "Тригексифенидил",
            "Метадон",
        ]
    },
    {
        question: "Для Галотана характерно:",
        type: "multiple",
        variants: [
            "Низкая наркотическая активность",
            "Продолжительная стадия возбуждения",
            "Вызывает выраженное расслабление скелетных мышц",
            "Медленное пробуждение при прекращении ингаляции",
            "Отсутствие пожароопасности",
        ]
    },
    {
        question: "Со стороны сердечно-сосудистой системы Галотан вызывает:",
        type: "multiple",
        variants: [
            "Тахикардию",
            "Брадикардию",
            "Сердечные аритмии",
            "Повышение артериального давления",
            "Гипотензию",
        ]
    }];

export const singleTemplate = {
    ablock: `<div class="ablock" id="yui_3_17_2_1_1651171091943_124">
    <div class="prompt">Выберите один ответ:</div>
    <div class="answer" id="yui_3_17_2_1_1651171091943_123"></div>
</div>`,
    variant: `<div class="r0"><input type="radio" name="q2621443:1_answer" value="0" id="q2621443:1_answer0"><label for="q2621443:1_answer0" class="d-flex w-100"><span class="answernumber"></span><div class="flex-fill ml-1"><p><span id="yui_3_17_2_1_1582178542837_284"><span id="yui_3_17_2_1_1582178542837_283" class="rvts46 variant-text">Эпидемии</span></span></p></div></label> </div>`
}

export const multipleTemplate = {
    ablock: `<div class="ablock">
    <div class="prompt">Выберите один или несколько ответов:</div>
    <div class="answer"></div>
    </div>`,
    variant: `<div class="r0" style="margin-bottom: 18px"><input type="hidden" name="q2612573:6_choice0" value="0" id="yui_3_17_2_1_1651165652212_36"><input
                type="checkbox" name="q2612573:6_choice0" value="1"
                id="q2612573:6_choice0"><label for="q2612573:6_choice0"
                                               class="d-flex w-100"><span
                class="answernumber"></span>
            <div class="flex-fill ml-1 variant-text"></div>`
}